class Menu:

    def __init__(self, scanner):
        self._scanner = None

        self._scanner = scanner

    def selectFunctions(self):
        print("""--------------------------------------
                    Выберите действие:
                    --------------------------------------
                    1. сложение
                    2. вычитание
                    3. деление
                    4. умножение
                    5. операции с комплексными числами
                    --------------------------------------
                    0. Выход
                    """, end='')
        return input()
